### 📖 Terraform Plan (infra/resources//dev) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.mcp_server.aws_apigatewayv2_integration.lambda_proxy will be created
  + resource "aws_apigatewayv2_integration" "lambda_proxy" {
      + api_id                                    = "pq3qc7rhn6"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.mcp_server.aws_apigatewayv2_route.proxy will be created
  + resource "aws_apigatewayv2_route" "proxy" {
      + api_id             = "pq3qc7rhn6"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.mcp_server.aws_lambda_function.server will be created
  + resource "aws_lambda_function" "server" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Lambda function running the DX MCP server"
      + function_name                  = "dx-p-eus1-mcp-server-lambda-01"
      + id                             = (known after apply)
      + image_uri                      = "366865817117.dkr.ecr.eu-central-1.amazonaws.com/dx/mcp-server:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::366865817117:role/dx-p-eus1-lambda-mcp-server-role-01"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "Developer Experience"
          + "Owner"          = "DevEx"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
      + tags_all                       = {
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "Developer Experience"
          + "Owner"          = "DevEx"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
      + timeout                        = 29
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BEDROCK_KNOWLEDGE_BASE_ID" = "TWMAUIB8QZ"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.mcp_server.aws_lambda_permission.apigw_http will be created
  + resource "aws_lambda_permission" "apigw_http" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dx-p-eus1-mcp-server-lambda-01"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:eu-central-1:366865817117:pq3qc7rhn6/*/*"
      + statement_id        = "AllowAPIGatewayV2Invoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on aws.tf line 11, in module "mcp_server":
  11:     aws = aws.eu-central-1

There is no explicit declaration for local provider name "aws" in
module.mcp_server, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)
```

</details>
